Repository: argrath/activitypub
Catalog: omegat/omegat/project_save.tmx
Source language: en
Languages: ja

source: You can POST to someone's inbox to send them a message (server-to-server / federation only... this is federation!)
ja: あなたは誰かにメッセージを送るためにその人の inbox に POST できます (サーバからサーバ / 連合のみ…これが連合です!)

source: You can POST to your outbox to send messages to the world (client-to-server)
ja: あなたは世界中にメッセージを送るためにあなたの outbox に POST できます (クライアントからサーバ)

source: You deserve freedom of communication; we hope we have contributed in some part, however small, towards that goal and right.
ja: あなた達には通信の自由がある; 私達は、このゴールと権利に向けて、 小さいながらも一部貢献していることを期待する。

source: [ActivityStreams] defines the collection concept; ActivityPub defines several collections with special behavior.
ja: [ActivityStreams] はコレクションの概念を定義している; ActivityPub は特殊な振る舞いをするコレクションをいくつか定義する。

source: an Activity being created in an actor's outbox or inbox which references another object.
ja: actor の outbox や inbox に、 他のオブジェクトを参照する Activity が作成された。

source: an Activity being created in an actor's outbox with directly addressed recipients.
ja: actor の outbox に、 直接アドレス指定された宛先で Activity が作成された。

source: an Activity being created in an actor's outbox with their Followers Collection as the recipient.
ja: actor の outbox に、宛先として Followers Collection を指定して Activity が作成された。

source: an Activity being created in an actors's outbox with user-curated collections as recipients.
ja: actor の outbox に、 ユーザーが選んだコレクションを宛先として Activity が作成された。

source: conduct any side effects related to the Activity (for example, notification that an actor has liked an object is used to update the object's like count);
ja: そのアクティビティに関連する副作用を実施する (例えば、ある actor があるオブジェクトに「いいね」をした通知は、 そのオブジェクトの「いいね」カウントを更新するのに使われる);

source: deliver the Activity to recipients of the original object, to ensure updates are propagated to the whole social graph (see inbox delivery).
ja: 更新が確実にソーシャルグラフ全体に伝搬するように、 Activity を元のオブジェクトの宛先に配送する (inbox delivery を参照のこと)。

source: it should dereference the id both to ensure that it exists and is a valid object, and that it is not misrepresenting the object.
ja: id の参照先を取得して、これが存在して妥当なオブジェクトであり、 このオブジェクトが不正確ではないことを確認するべきである。

source: the object is not allowed to be added to the target collection for some other reason, at the receiver's discretion.
ja: 受信者の裁量による何らかの理由により、 object を target コレクションに 追加することを認められていない場合。

source: the object is not allowed to be added to the target collection for some other reason, at the receiving server's discretion.
ja: 受信サーバの裁量により、なんらかの理由によって object を target コレクションに追加することを 認められていない。

source: the object is not allowed to be removed from the target collection for some other reason, at the receiving server's discretion.
ja: object が、受信サーバの裁量により、何らかの他の理由で target から削除することを認められていない。

source: the object is not allowed to be removed to the target collection for some other reason, at the receiver's discretion.
ja: 受信者の裁量による何らかの理由により、 object を target コレクションから 削除することを認められていない場合。

source: the target is not owned by the receiving server, and thus they are not authorized to update it.
ja: target が受信サーバによって所有されておらず、従ってこれを更新する権限がない。

source: the target is not owned by the receiving server, and thus they can't update it.
ja: target を受信サーバが所有しておらず、従って更新できない場合。

source: the like is generated by the client as:
ja: クライアントによって生成される「いいね」は:
